questions = [
    [
        "Любит решать логические и нестандартные задачи, склонен к рассуждению и анализу.",
        "Способен оперировать абстрактными понятиями.",
        "Создает конструкции из подручных средств: машины, самолеты, корабли и др.",
        "Интересуется книгами о технике, транспорте и космосе.",
        "Придумывает и рисует схемы технических объектов, таких как самолеты и корабли."
    ],
    [
        "Любит читать или слушать книги, размышлять о прочитанном.",
        "С удовольствием выполняет задания взрослых вместе с другими детьми.",
        "Придумывает собственные правила в играх с детьми.",
        "Охотно вступает в разговор с людьми на улице, в магазине, транспорте.",
        "Любит командные спортивные игры и легко находит новых друзей."
    ],
    [
        "Увлекается рисованием, лепкой и раскрашиванием.",
        "Придумывает сказки и истории про вымышленных или известных героев.",
        "С удовольствием поет, танцует, рассказывает стихи и играет пантомиму.",
        "Играет на предметах, издающих звуки, сочиняет мелодии к известным песням.",
        "Любит участвовать в сценических выступлениях."
    ],
    [
        "С удовольствием играет в подвижные и активные игры.",
        "Любит физические упражнения и делает их с охотой.",
        "Интересуется спортивными соревнованиями и знает известных спортсменов.",
        "Смотрит фильмы о спорте.",
        "Стремится быть первым в спортивных состязаниях."
    ],
    [
        "Любит слушать и читать рассказы о природе.",
        "Проводит много времени на свежем воздухе, в природной среде.",
        "Наблюдает за насекомыми и растениями.",
        "Изучает строение и образ жизни животных и растений.",
        "Следит за природными изменениями и проявляет интерес к климату.",
    ]
]

results = [
    "У ребенка выражены аналитические способности и интерес к решению задач, поэтому важно развивать его в математике, программировании и других смежных областях. Они требуют внимания к деталям, усидчивости и умения мыслить логически. Поддерживайте ребенка в желании участвовать в олимпиадах, изучать программирование и инженерные профессии.",
    "Если ребенку легко общаться с окружающими, он интересуется языками и не боится публичных выступлений — стоит направить его в сторону лингвистики, журналистики или социальной сферы. Участие в театральных кружках, командных интеллектуальных играх, дебатах и посещение языковых курсов помогут развивать эти таланты.",
    "Если у вас творческий ребенок, который любит рисовать, сочинять и создавать новое, то поддерживайте его в этом стремлении. Такие дети часто мыслят нестандартно и проявляют креативность в музыке, рисовании, литературе. Посещение художественных и музыкальных школ, изучение программ для дизайнеров помогут развить его способности.",
    "Физически активный ребенок может найти себя в спорте. Если у него нет противопоказаний, то обеспечьте ему условия для регулярных тренировок. Это поможет развить не только физическую форму, но и уверенность ребенка в себе. Важно: увлечение спортом не говорит о том, что ребенку не интересны интеллектуальные нагрузки: можно попробовать еще шахматы и программирование.",
    "Если ребенок любит природу и интересуется устройством мира, у него склонность к исследовательской деятельности и естественным наукам. Поощряйте его интерес через посещение выставок, зоопарков, мастер-классов по химии,  участие в проектах, связанных с экологией и окружающим миром."
]

questions_emodji = ["🤖", "🗣️", "🎨", "🏃‍♂️", "🌱"]