questions = [
    [
        "Решать логические задачи и задачи на сообразительность, склонен к логическим рассуждениям.",
        "Оперировать абстрактными понятиями.",
        "Конструировать из подручных материалов машины, корабли, самолеты и т.д.",
        "Читать книги о технике (машинах, комических кораблях).",
        "Рассматривать иллюстрации с изображением технических средств.",
        "Интересоваться новыми марками машин, самолетов, кораблей.",
        "Конструировать, рисовать проекты самолетов, кораблей и др."
    ],
    [
        "Слушать или читать самостоятельно книги, рассуждать о прочитанном.",
        "Вместе с другими детьми выполнять различные поручения взрослых.",
        "Слушать сказки и смотреть мультики на иностранном языке, быстро заучивать новые слова.",
        "Устанавливать свои правила в играх детей.",
        "Играть в игры с отгадыванием слов (названий городов, животных).",
        "Легко общаться с прохожими на улице, в магазине, транспорте.",
        "Играть в командные виды спорта, заводить новых друзей."
    ],
    [
        "Рисовать, лепить, раскрашивать.",
        "Рисовать самостоятельно, отстаивать свое видение предметов.",
        "Придумывать свои истории, сказки про известных или выдуманных персонажей.",
        "Напевать песни, танцевать, декламировать стихи, показывать пантомиму.",
        "Играть на всем что издает звуки, сочинять новый мотив к известным песенкам.",
        "Мечтать о различных событиях и вещах.",
        "Выступать на сцене."
    ],
    [
        "Играть в активные, подвижные игры.",
        "Всем видам деятельности предпочитать игру в мяч.",
        "С удовольствием делать физические упражнения.",
        "Знать чемпионов любимого вида спорта, интересоваться расписанием соревнований.",
        "Смотреть фильмы о спорте.",
        "Читать или слушать книги о спорте.",
        "Быть первым в спортивных соревнованиях."
    ],
    [
        "Слушать или читать рассказы о природе.",
        "Проводить время на природе.",
        "Наблюдать за растениями и насекомыми.",
        "Посещать антропологические, палеонтологические, краеведческие музеи.",
        "Интересоваться образом жизни, строением животных и растений.",
        "Наблюдать за изменениями природы, интересоваться климатом.",
        "Проводить химические опыты."
    ]
]

results = [
    "Если ребенок проявляет склонность к логическому мышлению, аналитике и решению задач, стоит обратить внимание на развитие его навыков в области математики, техники или программирования. Эти направления требуют усидчивости, внимания к деталям и умения работать с алгоритмами, что может стать основой для успешной карьеры в будущем. Поощряйте участие в олимпиадах, занятиях по робототехнике или программировании, чтобы укрепить интерес ребенка и раскрыть его потенциал.",
    "Ребенок с выраженными коммуникативными навыками и интересом к языкам может быть успешен в социальной сфере или лингвистике. Если он легко устанавливает контакт с окружающими, любит изучать иностранные языки или обладает талантом к публичным выступлениям, это может стать основой для будущей профессии. Поддерживайте развитие этих качеств через участие в дебатах, театральных кружках или курсах по изучению иностранных языков.",
    "Если ребенок увлечен искусством, музыкой или созданием чего-то нового, важно поддерживать его творческие начинания. Такие дети часто обладают богатым воображением и нестандартным мышлением, что может проявляться в рисовании, игре на музыкальных инструментах или написании текстов. Рекомендуем записать ребенка в художественную школу, музыкальные кружки или предоставить ему возможности для самовыражения через творчество.",
    "Для детей с выраженной активностью и любовью к физическим нагрузкам спорт может стать не только увлечением, но и профессиональным направлением. Если ребенок проявляет настойчивость, выносливость и интерес к командным или индивидуальным видам спорта, важно поддержать его стремления. Регулярные тренировки, участие в соревнованиях и развитие дисциплины помогут раскрыть его потенциал и укрепить уверенность в своих силах.",
    "Если ребенок проявляет интерес к окружающему миру, любит наблюдать за природой и задает вопросы о работе различных явлений, это указывает на склонность к естествознанию. Поддерживайте этот интерес через посещение музеев, зоопарков, научных выставок или участие в экологических проектах. Это поможет развить у ребенка исследовательские навыки и привить любовь к науке.",
]